SayidHosseini/STM32LiquidCrystal/examples/CustomCharacter/main.c
/*
  LiquidCrystal Library - Custom Characters
 Demonstrates the use of a 16x2 LCD display.  The LiquidCrystal
 library works with all LCD displays that are compatible with the
 Hitachi HD44780 driver. There are many of them out there, and you
 can usually tell them by the 16-pin interface.
 This sketch prints "I <heart> ARM!" and a little dancing man
 to the LCD.
 The circuit:
 * LCD RS pin to PD8
 * LCD R/W pin to PD9
 * LCD En pin to PD10
 * LCD D4 pin to PD11
 * LCD D5 pin to PD12
 * LCD D6 pin to PD13
 * LCD D7 pin to PD14
 * 10K resistor:
 * ends to +5V and ground
 * wiper to LCD VO pin (pin 3)
 library originated from Arduino, Adafruit and ported 12 Apr 2018
 by S. Saeed Hosseini (sayidhosseii@hotmail.com)
 example originated from Arduino, Adafruit and ported 13 Apr 2018
 by S. Saeed Hosseini (sayidhosseii@hotmail.com)
 
 Based on Adafruit's example at
 https://github.com/adafruit/SPI_VFD/blob/master/examples/createChar/createChar.pde
 This example code is in the public domain.
 https://github.com/SayidHosseini/LiquidCrystal/tree/master/examples/CustomeCharacter
 
 Also useful:
 http://icontexto.com/charactercreator/
*/

#include "stm32f3xx_hal.h" // change this here and inside LiquidCrystal library accordingly
#include "LiquidCrystal.h"

// byte is not defined here by default
typedef unsigned char byte;

// make some custom characters:
byte heart[8] = {
  0x00, // 0b00000,
  0x0A, // 0b01010,
  0x1F, // 0b11111,
  0x1F, // 0b11111,
  0x1F, // 0b11111,
  0x0E, // 0b01110,
  0x04, // 0b00100,
  0x00  // 0b00000
};

byte smiley[8] = {
  0x00, // 0b00000,
  0x00, // 0b00000,
  0x0A, // 0b01010,
  0x00, // 0b00000,
  0x00, // 0b00000,
  0x11, // 0b10001,
  0x0E, // 0b01110,
  0x00  // 0b00000
};

byte frownie[8] = {
  0x00, // 0b00000,
  0x00, // 0b00000,
  0x0A, // 0b01010,
  0x00, // 0b00000,
  0x00, // 0b00000,
  0x00, // 0b00000,
  0x0E, // 0b01110,
  0x11  // 0b10001
};

byte armsDown[8] = {
  0x04, // 0b00100,
  0x0A, // 0b01010,
  0x04, // 0b00100,
  0x04, // 0b00100,
  0x0E, // 0b01110,
  0x15, // 0b10101,
  0x04, // 0b00100,
  0x0A  // 0b01010
};

byte armsUp[8] = {
  0x04, // 0b00100,
  0x0A, // 0b01010,
  0x04, // 0b00100,
  0x15, // 0b10101,
  0x0E, // 0b01110,
  0x04, // 0b00100,
  0x04, // 0b00100,
  0x0A  // 0b01010
};

// ISR Required by the library (for HAL_Delay)
void SysTick_Handler(void);

int main(void)
{
  // Initializing SysTick - required by the library
	HAL_Init();

	// initialize the library by associating any needed LCD interface pin
	LiquidCrystal(GPIOD, GPIO_PIN_8, GPIO_PIN_9, GPIO_PIN_10, GPIO_PIN_11, GPIO_PIN_12, GPIO_PIN_13, GPIO_PIN_14);
	
  // create a new character
  createChar(0, heart);
  // create a new character
  createChar(1, smiley);
  // create a new character
  createChar(2, frownie);
  // create a new character
  createChar(3, armsDown);
  // create a new character
  createChar(4, armsUp);

  // Print a message to the lcd.
	setCursor(1, 0); // This line is vital. You should set the cursor after you createChar.
  print("I ");
  write((0)); // love :-D
  print(" ARM! ");
  write(1);

	
	while(1)
	{
		setCursor(4, 1);
		// draw the little man, arms down:
		write(3);
		HAL_Delay(500);
		setCursor(4, 1);
		// draw him arms up:
		write(4);
		HAL_Delay(500);
	}
}

void SysTick_Handler(void)
{
	HAL_IncTick();
}
